Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_usbd.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; nrf5340_application_usbd.
; =========================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     nrf5340_application_usbd equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// USBD address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    TASKS_STARTEPIN[8];
    volatile    uint32_t    TASKS_STARTISOIN;
    volatile    uint32_t    TASKS_STARTEPOUT[8];
    volatile    uint32_t    TASKS_STARTISOOUT;
    volatile    uint32_t    TASKS_EP0RCVOUT;
    volatile    uint32_t    TASKS_EP0STATUS;
    volatile    uint32_t    TASKS_EP0STALL;
    volatile    uint32_t    TASKS_DPDMDRIVE;
    volatile    uint32_t    TASKS_DPDMNODRIVE;
    volatile    uint32_t    RESERVED1[9];
    volatile    uint32_t    SUBSCRIBE_STARTEPIN[8];
    volatile    uint32_t    SUBSCRIBE_STARTISOIN;
    volatile    uint32_t    SUBSCRIBE_STARTEPOUT[8];
    volatile    uint32_t    SUBSCRIBE_STARTISOOUT;
    volatile    uint32_t    SUBSCRIBE_EP0RCVOUT;
    volatile    uint32_t    SUBSCRIBE_EP0STATUS;
    volatile    uint32_t    SUBSCRIBE_EP0STALL;
    volatile    uint32_t    SUBSCRIBE_DPDMDRIVE;
    volatile    uint32_t    SUBSCRIBE_DPDMNODRIVE;
    volatile    uint32_t    RESERVED2[8];
    volatile    uint32_t    EVENTS_USBRESET;
    volatile    uint32_t    EVENTS_STARTED;
    volatile    uint32_t    EVENTS_ENDEPIN[8];
    volatile    uint32_t    EVENTS_EP0DATADONE;
    volatile    uint32_t    EVENTS_ENDISOIN;
    volatile    uint32_t    EVENTS_ENDEPOUT[8];
    volatile    uint32_t    EVENTS_ENDISOOUT;
    volatile    uint32_t    EVENTS_SOF;
    volatile    uint32_t    EVENTS_USBEVENT;
    volatile    uint32_t    EVENTS_EP0SETUP;
    volatile    uint32_t    EVENTS_EPDATA;
    volatile    uint32_t    RESERVED3[7];
    volatile    uint32_t    PUBLISH_USBRESET;
    volatile    uint32_t    PUBLISH_STARTED;
    volatile    uint32_t    PUBLISH_ENDEPIN[8];
    volatile    uint32_t    PUBLISH_EP0DATADONE;
    volatile    uint32_t    PUBLISH_ENDISOIN;
    volatile    uint32_t    PUBLISH_ENDEPOUT[8];
    volatile    uint32_t    PUBLISH_ENDISOOUT;
    volatile    uint32_t    PUBLISH_SOF;
    volatile    uint32_t    PUBLISH_USBEVENT;
    volatile    uint32_t    PUBLISH_EP0SETUP;
    volatile    uint32_t    PUBLISH_EPDATA;
    volatile    uint32_t    RESERVED4[7];
    volatile    uint32_t    SHORTS;
    volatile    uint32_t    RESERVED5[63];
    volatile    uint32_t    INTEN;
    volatile    uint32_t    INTENSET;
    volatile    uint32_t    INTENCLR;
    volatile    uint32_t    RESERVED6[61];
    volatile    uint32_t    EVENTCAUSE;
    volatile    uint32_t    RESERVED7[7];
    volatile    uint32_t    HALTED_EPIN[8];
    volatile    uint32_t    RESERVED8;
    volatile    uint32_t    HALTED_EPOUT[8];
    volatile    uint32_t    RESERVED9;
    volatile    uint32_t    EPSTATUS;
    volatile    uint32_t    EPDATASTATUS;
    volatile    uint32_t    USBADDR;
    volatile    uint32_t    RESERVED10[3];
    volatile    uint32_t    BMREQUESTTYPE;
    volatile    uint32_t    BREQUEST;
    volatile    uint32_t    WVALUEL;
    volatile    uint32_t    WVALUEH;
    volatile    uint32_t    WINDEXL;
    volatile    uint32_t    WINDEXH;
    volatile    uint32_t    WLENGTHL;
    volatile    uint32_t    WLENGTHH;
    volatile    uint32_t    SIZE_EPOUT[8];
    volatile    uint32_t    SIZE_ISOOUT;
    volatile    uint32_t    RESERVED11[15];
    volatile    uint32_t    ENABLE;
    volatile    uint32_t    USBPULLUP;
    volatile    uint32_t    DPDMVALUE;
    volatile    uint32_t    DTOGGLE;
    volatile    uint32_t    EPINEN;
    volatile    uint32_t    EPOUTEN;
    volatile    uint32_t    EPSTALL;
    volatile    uint32_t    ISOSPLIT;
    volatile    uint32_t    FRAMECNTR;
    volatile    uint32_t    RESERVED12[2];
    volatile    uint32_t    LOWPOWER;
    volatile    uint32_t    ISOINCONFIG;
    volatile    uint32_t    RESERVED13[51];
    volatile    uint32_t    EPIN0_PTR;
    volatile    uint32_t    EPIN0_MAXCNT;
    volatile    uint32_t    EPIN0_AMOUNT;
    volatile    uint32_t    RESERVED14[2];
    volatile    uint32_t    EPIN1_PTR;
    volatile    uint32_t    EPIN1_MAXCNT;
    volatile    uint32_t    EPIN1_AMOUNT;
    volatile    uint32_t    RESERVED15[2];
    volatile    uint32_t    EPIN2_PTR;
    volatile    uint32_t    EPIN2_MAXCNT;
    volatile    uint32_t    EPIN2_AMOUNT;
    volatile    uint32_t    RESERVED16[2];
    volatile    uint32_t    EPIN3_PTR;
    volatile    uint32_t    EPIN3_MAXCNT;
    volatile    uint32_t    EPIN3_AMOUNT;
    volatile    uint32_t    RESERVED17[2];
    volatile    uint32_t    EPIN4_PTR;
    volatile    uint32_t    EPIN4_MAXCNT;
    volatile    uint32_t    EPIN4_AMOUNT;
    volatile    uint32_t    RESERVED18[2];
    volatile    uint32_t    EPIN5_PTR;
    volatile    uint32_t    EPIN5_MAXCNT;
    volatile    uint32_t    EPIN5_AMOUNT;
    volatile    uint32_t    RESERVED19[2];
    volatile    uint32_t    EPIN6_PTR;
    volatile    uint32_t    EPIN6_MAXCNT;
    volatile    uint32_t    EPIN6_AMOUNT;
    volatile    uint32_t    RESERVED20[2];
    volatile    uint32_t    EPIN7_PTR;
    volatile    uint32_t    EPIN7_MAXCNT;
    volatile    uint32_t    EPIN7_AMOUNT;
    volatile    uint32_t    RESERVED21[2];
    volatile    uint32_t    ISOIN_PTR;
    volatile    uint32_t    ISOIN_MAXCNT;
    volatile    uint32_t    ISOIN_AMOUNT;
    volatile    uint32_t    RESERVED22[21];
    volatile    uint32_t    EPOUT0_PTR;
    volatile    uint32_t    EPOUT0_MAXCNT;
    volatile    uint32_t    EPOUT0_AMOUNT;
    volatile    uint32_t    RESERVED23[2];
    volatile    uint32_t    EPOUT1_PTR;
    volatile    uint32_t    EPOUT1_MAXCNT;
    volatile    uint32_t    EPOUT1_AMOUNT;
    volatile    uint32_t    RESERVED24[2];
    volatile    uint32_t    EPOUT2_PTR;
    volatile    uint32_t    EPOUT2_MAXCNT;
    volatile    uint32_t    EPOUT2_AMOUNT;
    volatile    uint32_t    RESERVED25[2];
    volatile    uint32_t    EPOUT3_PTR;
    volatile    uint32_t    EPOUT3_MAXCNT;
    volatile    uint32_t    EPOUT3_AMOUNT;
    volatile    uint32_t    RESERVED26[2];
    volatile    uint32_t    EPOUT4_PTR;
    volatile    uint32_t    EPOUT4_MAXCNT;
    volatile    uint32_t    EPOUT4_AMOUNT;
    volatile    uint32_t    RESERVED27[2];
    volatile    uint32_t    EPOUT5_PTR;
    volatile    uint32_t    EPOUT5_MAXCNT;
    volatile    uint32_t    EPOUT5_AMOUNT;
    volatile    uint32_t    RESERVED28[2];
    volatile    uint32_t    EPOUT6_PTR;
    volatile    uint32_t    EPOUT6_MAXCNT;
    volatile    uint32_t    EPOUT6_AMOUNT;
    volatile    uint32_t    RESERVED29[2];
    volatile    uint32_t    EPOUT7_PTR;
    volatile    uint32_t    EPOUT7_MAXCNT;
    volatile    uint32_t    EPOUT7_AMOUNT;
    volatile    uint32_t    RESERVED30[2];
    volatile    uint32_t    ISOOUT_PTR;
    volatile    uint32_t    ISOOUT_MAXCNT;
    volatile    uint32_t    ISOOUT_AMOUNT;
} USBD_TypeDef;

#ifdef __cplusplus
#define USBD_NS reinterpret_cast<USBD_TypeDef *>(0x40036000u)
#define USBD_S  reinterpret_cast<USBD_TypeDef *>(0x50036000u)

#else
#define USBD_NS ((USBD_TypeDef *)0x40036000u)
#define USBD_S  ((USBD_TypeDef *)0x50036000u)
#endif

// TASKS_STARTEPIN Configuration

#define USBD_TASKS_STARTEPIN_TASKS_STARTEPIN                        (0x1u<<0)
#define USBD_TASKS_STARTEPIN_TASKS_STARTEPIN_TRIGGER                (0x1u<<0)

// TASKS_STARTISOIN Configuration

#define USBD_TASKS_STARTISOIN_TASKS_STARTISOIN                      (0x1u<<0)
#define USBD_TASKS_STARTISOIN_TASKS_STARTISOIN_TRIGGER              (0x1u<<0)

