Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_usbd.h
// TASKS_STARTEPOUT Configuration

#define USBD_TASKS_STARTEPOUT_TASKS_STARTEPOUT                      (0x1u<<0)
#define USBD_TASKS_STARTEPOUT_TASKS_STARTEPOUT_TRIGGER              (0x1u<<0)

// TASKS_STARTISOOUT Configuration

#define USBD_TASKS_STARTISOOUT_TASKS_STARTISOOUT                    (0x1u<<0)
#define USBD_TASKS_STARTISOOUT_TASKS_STARTISOOUT_TRIGGER            (0x1u<<0)

// TASKS_EP0RCVOUT Configuration

#define USBD_TASKS_EP0RCVOUT_TASKS_EP0RCVOUT                        (0x1u<<0)
#define USBD_TASKS_EP0RCVOUT_TASKS_EP0RCVOUT_TRIGGER                (0x1u<<0)

// TASKS_EP0STATUS Configuration

#define USBD_TASKS_EP0STATUS_TASKS_EP0STATUS                        (0x1u<<0)
#define USBD_TASKS_EP0STATUS_TASKS_EP0STATUS_TRIGGER                (0x1u<<0)

// TASKS_EP0STALL Configuration

#define USBD_TASKS_EP0STALL_TASKS_EP0STALL                          (0x1u<<0)
#define USBD_TASKS_EP0STALL_TASKS_EP0STALL_TRIGGER                  (0x1u<<0)

// TASKS_DPDMDRIVE Configuration

#define USBD_TASKS_DPDMDRIVE_TASKS_DPDMDRIVE                        (0x1u<<0)
#define USBD_TASKS_DPDMDRIVE_TASKS_DPDMDRIVE_TRIGGER                (0x1u<<0)

// TASKS_DPDMNODRIVE Configuration

#define USBD_TASKS_DPDMNODRIVE_TASKS_DPDMNODRIVE                    (0x1u<<0)
#define USBD_TASKS_DPDMNODRIVE_TASKS_DPDMNODRIVE_TRIGGER            (0x1u<<0)

// SUBSCRIBE_STARTEPIN Configuration

#define USBD_SUBSCRIBE_STARTEPIN_EN                                 (0x1u<<31)
#define USBD_SUBSCRIBE_STARTEPIN_CHIDX                              (0xFFu<<0)
#define USBD_SUBSCRIBE_STARTEPIN_CHIDX_0                            (0x1u<<0)
#define USBD_SUBSCRIBE_STARTEPIN_EN_DISABLED                        (0x0u<<31)
#define USBD_SUBSCRIBE_STARTEPIN_EN_ENABLED                         (0x1u<<31)

// SUBSCRIBE_STARTISOIN Configuration

#define USBD_SUBSCRIBE_STARTISOIN_EN                                (0x1u<<31)
#define USBD_SUBSCRIBE_STARTISOIN_CHIDX                             (0xFFu<<0)
#define USBD_SUBSCRIBE_STARTISOIN_CHIDX_0                           (0x1u<<0)
#define USBD_SUBSCRIBE_STARTISOIN_EN_DISABLED                       (0x0u<<31)
#define USBD_SUBSCRIBE_STARTISOIN_EN_ENABLED                        (0x1u<<31)

// SUBSCRIBE_STARTEPOUT Configuration

#define USBD_SUBSCRIBE_STARTEPOUT_EN                                (0x1u<<31)
#define USBD_SUBSCRIBE_STARTEPOUT_CHIDX                             (0xFFu<<0)
#define USBD_SUBSCRIBE_STARTEPOUT_CHIDX_0                           (0x1u<<0)
#define USBD_SUBSCRIBE_STARTEPOUT_EN_DISABLED                       (0x0u<<31)
#define USBD_SUBSCRIBE_STARTEPOUT_EN_ENABLED                        (0x1u<<31)

// SUBSCRIBE_STARTISOOUT Configuration

#define USBD_SUBSCRIBE_STARTISOOUT_EN                               (0x1u<<31)
#define USBD_SUBSCRIBE_STARTISOOUT_CHIDX                            (0xFFu<<0)
#define USBD_SUBSCRIBE_STARTISOOUT_CHIDX_0                          (0x1u<<0)
#define USBD_SUBSCRIBE_STARTISOOUT_EN_DISABLED                      (0x0u<<31)
#define USBD_SUBSCRIBE_STARTISOOUT_EN_ENABLED                       (0x1u<<31)

// SUBSCRIBE_EP0RCVOUT Configuration

#define USBD_SUBSCRIBE_EP0RCVOUT_EN                                 (0x1u<<31)
#define USBD_SUBSCRIBE_EP0RCVOUT_CHIDX                              (0xFFu<<0)
#define USBD_SUBSCRIBE_EP0RCVOUT_CHIDX_0                            (0x1u<<0)
#define USBD_SUBSCRIBE_EP0RCVOUT_EN_DISABLED                        (0x0u<<31)
#define USBD_SUBSCRIBE_EP0RCVOUT_EN_ENABLED                         (0x1u<<31)

// SUBSCRIBE_EP0STATUS Configuration

#define USBD_SUBSCRIBE_EP0STATUS_EN                                 (0x1u<<31)
#define USBD_SUBSCRIBE_EP0STATUS_CHIDX                              (0xFFu<<0)
#define USBD_SUBSCRIBE_EP0STATUS_CHIDX_0                            (0x1u<<0)
#define USBD_SUBSCRIBE_EP0STATUS_EN_DISABLED                        (0x0u<<31)
#define USBD_SUBSCRIBE_EP0STATUS_EN_ENABLED                         (0x1u<<31)

// SUBSCRIBE_EP0STALL Configuration

#define USBD_SUBSCRIBE_EP0STALL_EN                                  (0x1u<<31)
#define USBD_SUBSCRIBE_EP0STALL_CHIDX                               (0xFFu<<0)
#define USBD_SUBSCRIBE_EP0STALL_CHIDX_0                             (0x1u<<0)
#define USBD_SUBSCRIBE_EP0STALL_EN_DISABLED                         (0x0u<<31)
#define USBD_SUBSCRIBE_EP0STALL_EN_ENABLED                          (0x1u<<31)

// SUBSCRIBE_DPDMDRIVE Configuration

#define USBD_SUBSCRIBE_DPDMDRIVE_EN                                 (0x1u<<31)
#define USBD_SUBSCRIBE_DPDMDRIVE_CHIDX                              (0xFFu<<0)
#define USBD_SUBSCRIBE_DPDMDRIVE_CHIDX_0                            (0x1u<<0)
#define USBD_SUBSCRIBE_DPDMDRIVE_EN_DISABLED                        (0x0u<<31)
#define USBD_SUBSCRIBE_DPDMDRIVE_EN_ENABLED                         (0x1u<<31)

// SUBSCRIBE_DPDMNODRIVE Configuration

#define USBD_SUBSCRIBE_DPDMNODRIVE_EN                               (0x1u<<31)
#define USBD_SUBSCRIBE_DPDMNODRIVE_CHIDX                            (0xFFu<<0)
#define USBD_SUBSCRIBE_DPDMNODRIVE_CHIDX_0                          (0x1u<<0)
#define USBD_SUBSCRIBE_DPDMNODRIVE_EN_DISABLED                      (0x0u<<31)
#define USBD_SUBSCRIBE_DPDMNODRIVE_EN_ENABLED                       (0x1u<<31)

// EVENTS_USBRESET Configuration

#define USBD_EVENTS_USBRESET_EVENTS_USBRESET                        (0x1u<<0)
#define USBD_EVENTS_USBRESET_EVENTS_USBRESET_NOTGENERATED           (0x0u<<0)
#define USBD_EVENTS_USBRESET_EVENTS_USBRESET_GENERATED              (0x1u<<0)

// EVENTS_STARTED Configuration

#define USBD_EVENTS_STARTED_EVENTS_STARTED                          (0x1u<<0)
#define USBD_EVENTS_STARTED_EVENTS_STARTED_NOTGENERATED             (0x0u<<0)
#define USBD_EVENTS_STARTED_EVENTS_STARTED_GENERATED                (0x1u<<0)

// EVENTS_ENDEPIN Configuration

#define USBD_EVENTS_ENDEPIN_EVENTS_ENDEPIN                          (0x1u<<0)
#define USBD_EVENTS_ENDEPIN_EVENTS_ENDEPIN_NOTGENERATED             (0x0u<<0)
#define USBD_EVENTS_ENDEPIN_EVENTS_ENDEPIN_GENERATED                (0x1u<<0)

// EVENTS_EP0DATADONE Configuration

