Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_usbd.h
#define USBD_EVENTS_EP0DATADONE_EVENTS_EP0DATADONE                  (0x1u<<0)
#define USBD_EVENTS_EP0DATADONE_EVENTS_EP0DATADONE_NOTGENERATED     (0x0u<<0)
#define USBD_EVENTS_EP0DATADONE_EVENTS_EP0DATADONE_GENERATED        (0x1u<<0)

// EVENTS_ENDISOIN Configuration

#define USBD_EVENTS_ENDISOIN_EVENTS_ENDISOIN                        (0x1u<<0)
#define USBD_EVENTS_ENDISOIN_EVENTS_ENDISOIN_NOTGENERATED           (0x0u<<0)
#define USBD_EVENTS_ENDISOIN_EVENTS_ENDISOIN_GENERATED              (0x1u<<0)

// EVENTS_ENDEPOUT Configuration

#define USBD_EVENTS_ENDEPOUT_EVENTS_ENDEPOUT                        (0x1u<<0)
#define USBD_EVENTS_ENDEPOUT_EVENTS_ENDEPOUT_NOTGENERATED           (0x0u<<0)
#define USBD_EVENTS_ENDEPOUT_EVENTS_ENDEPOUT_GENERATED              (0x1u<<0)

// EVENTS_ENDISOOUT Configuration

#define USBD_EVENTS_ENDISOOUT_EVENTS_ENDISOOUT                      (0x1u<<0)
#define USBD_EVENTS_ENDISOOUT_EVENTS_ENDISOOUT_NOTGENERATED         (0x0u<<0)
#define USBD_EVENTS_ENDISOOUT_EVENTS_ENDISOOUT_GENERATED            (0x1u<<0)

// EVENTS_SOF Configuration

#define USBD_EVENTS_SOF_EVENTS_SOF                                  (0x1u<<0)
#define USBD_EVENTS_SOF_EVENTS_SOF_NOTGENERATED                     (0x0u<<0)
#define USBD_EVENTS_SOF_EVENTS_SOF_GENERATED                        (0x1u<<0)

// EVENTS_USBEVENT Configuration

#define USBD_EVENTS_USBEVENT_EVENTS_USBEVENT                        (0x1u<<0)
#define USBD_EVENTS_USBEVENT_EVENTS_USBEVENT_NOTGENERATED           (0x0u<<0)
#define USBD_EVENTS_USBEVENT_EVENTS_USBEVENT_GENERATED              (0x1u<<0)

// EVENTS_EP0SETUP Configuration

#define USBD_EVENTS_EP0SETUP_EVENTS_EP0SETUP                        (0x1u<<0)
#define USBD_EVENTS_EP0SETUP_EVENTS_EP0SETUP_NOTGENERATED           (0x0u<<0)
#define USBD_EVENTS_EP0SETUP_EVENTS_EP0SETUP_GENERATED              (0x1u<<0)

// EVENTS_EPDATA Configuration

#define USBD_EVENTS_EPDATA_EVENTS_EPDATA                            (0x1u<<0)
#define USBD_EVENTS_EPDATA_EVENTS_EPDATA_NOTGENERATED               (0x0u<<0)
#define USBD_EVENTS_EPDATA_EVENTS_EPDATA_GENERATED                  (0x1u<<0)

// PUBLISH_USBRESET Configuration

#define USBD_PUBLISH_USBRESET_EN                                    (0x1u<<31)
#define USBD_PUBLISH_USBRESET_CHIDX                                 (0xFFu<<0)
#define USBD_PUBLISH_USBRESET_CHIDX_0                               (0x1u<<0)
#define USBD_PUBLISH_USBRESET_EN_DISABLED                           (0x0u<<31)
#define USBD_PUBLISH_USBRESET_EN_ENABLED                            (0x1u<<31)

// PUBLISH_STARTED Configuration

#define USBD_PUBLISH_STARTED_EN                                     (0x1u<<31)
#define USBD_PUBLISH_STARTED_CHIDX                                  (0xFFu<<0)
#define USBD_PUBLISH_STARTED_CHIDX_0                                (0x1u<<0)
#define USBD_PUBLISH_STARTED_EN_DISABLED                            (0x0u<<31)
#define USBD_PUBLISH_STARTED_EN_ENABLED                             (0x1u<<31)

// PUBLISH_ENDEPIN Configuration

#define USBD_PUBLISH_ENDEPIN_EN                                     (0x1u<<31)
#define USBD_PUBLISH_ENDEPIN_CHIDX                                  (0xFFu<<0)
#define USBD_PUBLISH_ENDEPIN_CHIDX_0                                (0x1u<<0)
#define USBD_PUBLISH_ENDEPIN_EN_DISABLED                            (0x0u<<31)
#define USBD_PUBLISH_ENDEPIN_EN_ENABLED                             (0x1u<<31)

// PUBLISH_EP0DATADONE Configuration

#define USBD_PUBLISH_EP0DATADONE_EN                                 (0x1u<<31)
#define USBD_PUBLISH_EP0DATADONE_CHIDX                              (0xFFu<<0)
#define USBD_PUBLISH_EP0DATADONE_CHIDX_0                            (0x1u<<0)
#define USBD_PUBLISH_EP0DATADONE_EN_DISABLED                        (0x0u<<31)
#define USBD_PUBLISH_EP0DATADONE_EN_ENABLED                         (0x1u<<31)

// PUBLISH_ENDISOIN Configuration

#define USBD_PUBLISH_ENDISOIN_EN                                    (0x1u<<31)
#define USBD_PUBLISH_ENDISOIN_CHIDX                                 (0xFFu<<0)
#define USBD_PUBLISH_ENDISOIN_CHIDX_0                               (0x1u<<0)
#define USBD_PUBLISH_ENDISOIN_EN_DISABLED                           (0x0u<<31)
#define USBD_PUBLISH_ENDISOIN_EN_ENABLED                            (0x1u<<31)

// PUBLISH_ENDEPOUT Configuration

#define USBD_PUBLISH_ENDEPOUT_EN                                    (0x1u<<31)
#define USBD_PUBLISH_ENDEPOUT_CHIDX                                 (0xFFu<<0)
#define USBD_PUBLISH_ENDEPOUT_CHIDX_0                               (0x1u<<0)
#define USBD_PUBLISH_ENDEPOUT_EN_DISABLED                           (0x0u<<31)
#define USBD_PUBLISH_ENDEPOUT_EN_ENABLED                            (0x1u<<31)

// PUBLISH_ENDISOOUT Configuration

#define USBD_PUBLISH_ENDISOOUT_EN                                   (0x1u<<31)
#define USBD_PUBLISH_ENDISOOUT_CHIDX                                (0xFFu<<0)
#define USBD_PUBLISH_ENDISOOUT_CHIDX_0                              (0x1u<<0)
#define USBD_PUBLISH_ENDISOOUT_EN_DISABLED                          (0x0u<<31)
#define USBD_PUBLISH_ENDISOOUT_EN_ENABLED                           (0x1u<<31)

// PUBLISH_SOF Configuration

#define USBD_PUBLISH_SOF_EN                                         (0x1u<<31)
#define USBD_PUBLISH_SOF_CHIDX                                      (0xFFu<<0)
#define USBD_PUBLISH_SOF_CHIDX_0                                    (0x1u<<0)
#define USBD_PUBLISH_SOF_EN_DISABLED                                (0x0u<<31)
#define USBD_PUBLISH_SOF_EN_ENABLED                                 (0x1u<<31)

// PUBLISH_USBEVENT Configuration

#define USBD_PUBLISH_USBEVENT_EN                                    (0x1u<<31)
#define USBD_PUBLISH_USBEVENT_CHIDX                                 (0xFFu<<0)
#define USBD_PUBLISH_USBEVENT_CHIDX_0                               (0x1u<<0)
#define USBD_PUBLISH_USBEVENT_EN_DISABLED                           (0x0u<<31)
#define USBD_PUBLISH_USBEVENT_EN_ENABLED                            (0x1u<<31)

// PUBLISH_EP0SETUP Configuration

