Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_usbd.h
#define USBD_PUBLISH_EP0SETUP_EN                                    (0x1u<<31)
#define USBD_PUBLISH_EP0SETUP_CHIDX                                 (0xFFu<<0)
#define USBD_PUBLISH_EP0SETUP_CHIDX_0                               (0x1u<<0)
#define USBD_PUBLISH_EP0SETUP_EN_DISABLED                           (0x0u<<31)
#define USBD_PUBLISH_EP0SETUP_EN_ENABLED                            (0x1u<<31)

// PUBLISH_EPDATA Configuration

#define USBD_PUBLISH_EPDATA_EN                                      (0x1u<<31)
#define USBD_PUBLISH_EPDATA_CHIDX                                   (0xFFu<<0)
#define USBD_PUBLISH_EPDATA_CHIDX_0                                 (0x1u<<0)
#define USBD_PUBLISH_EPDATA_EN_DISABLED                             (0x0u<<31)
#define USBD_PUBLISH_EPDATA_EN_ENABLED                              (0x1u<<31)

// SHORTS Configuration

#define USBD_SHORTS_ENDEPOUT0_EP0RCVOUT                             (0x1u<<4)
#define USBD_SHORTS_ENDEPOUT0_EP0STATUS                             (0x1u<<3)
#define USBD_SHORTS_EP0DATADONE_EP0STATUS                           (0x1u<<2)
#define USBD_SHORTS_EP0DATADONE_STARTEPOUT0                         (0x1u<<1)
#define USBD_SHORTS_EP0DATADONE_STARTEPIN0                          (0x1u<<0)
#define USBD_SHORTS_ENDEPOUT0_EP0RCVOUT_DISABLED                    (0x0u<<4)
#define USBD_SHORTS_ENDEPOUT0_EP0RCVOUT_ENABLED                     (0x1u<<4)
#define USBD_SHORTS_ENDEPOUT0_EP0STATUS_DISABLED                    (0x0u<<3)
#define USBD_SHORTS_ENDEPOUT0_EP0STATUS_ENABLED                     (0x1u<<3)
#define USBD_SHORTS_EP0DATADONE_EP0STATUS_DISABLED                  (0x0u<<2)
#define USBD_SHORTS_EP0DATADONE_EP0STATUS_ENABLED                   (0x1u<<2)
#define USBD_SHORTS_EP0DATADONE_STARTEPOUT0_DISABLED                (0x0u<<1)
#define USBD_SHORTS_EP0DATADONE_STARTEPOUT0_ENABLED                 (0x1u<<1)
#define USBD_SHORTS_EP0DATADONE_STARTEPIN0_DISABLED                 (0x0u<<0)
#define USBD_SHORTS_EP0DATADONE_STARTEPIN0_ENABLED                  (0x1u<<0)

// INTEN Configuration

#define USBD_INTEN_EPDATA                                           (0x1u<<24)
#define USBD_INTEN_EP0SETUP                                         (0x1u<<23)
#define USBD_INTEN_USBEVENT                                         (0x1u<<22)
#define USBD_INTEN_SOF                                              (0x1u<<21)
#define USBD_INTEN_ENDISOOUT                                        (0x1u<<20)
#define USBD_INTEN_ENDEPOUT7                                        (0x1u<<19)
#define USBD_INTEN_ENDEPOUT6                                        (0x1u<<18)
#define USBD_INTEN_ENDEPOUT5                                        (0x1u<<17)
#define USBD_INTEN_ENDEPOUT4                                        (0x1u<<16)
#define USBD_INTEN_ENDEPOUT3                                        (0x1u<<15)
#define USBD_INTEN_ENDEPOUT2                                        (0x1u<<14)
#define USBD_INTEN_ENDEPOUT1                                        (0x1u<<13)
#define USBD_INTEN_ENDEPOUT0                                        (0x1u<<12)
#define USBD_INTEN_ENDISOIN                                         (0x1u<<11)
#define USBD_INTEN_EP0DATADONE                                      (0x1u<<10)
#define USBD_INTEN_ENDEPIN7                                         (0x1u<<9)
#define USBD_INTEN_ENDEPIN6                                         (0x1u<<8)
#define USBD_INTEN_ENDEPIN5                                         (0x1u<<7)
#define USBD_INTEN_ENDEPIN4                                         (0x1u<<6)
#define USBD_INTEN_ENDEPIN3                                         (0x1u<<5)
#define USBD_INTEN_ENDEPIN2                                         (0x1u<<4)
#define USBD_INTEN_ENDEPIN1                                         (0x1u<<3)
#define USBD_INTEN_ENDEPIN0                                         (0x1u<<2)
#define USBD_INTEN_STARTED                                          (0x1u<<1)
#define USBD_INTEN_USBRESET                                         (0x1u<<0)
#define USBD_INTEN_EPDATA_DISABLED                                  (0x0u<<24)
#define USBD_INTEN_EPDATA_ENABLED                                   (0x1u<<24)
#define USBD_INTEN_EP0SETUP_DISABLED                                (0x0u<<23)
#define USBD_INTEN_EP0SETUP_ENABLED                                 (0x1u<<23)
#define USBD_INTEN_USBEVENT_DISABLED                                (0x0u<<22)
#define USBD_INTEN_USBEVENT_ENABLED                                 (0x1u<<22)
#define USBD_INTEN_SOF_DISABLED                                     (0x0u<<21)
#define USBD_INTEN_SOF_ENABLED                                      (0x1u<<21)
#define USBD_INTEN_ENDISOOUT_DISABLED                               (0x0u<<20)
#define USBD_INTEN_ENDISOOUT_ENABLED                                (0x1u<<20)
#define USBD_INTEN_ENDEPOUT7_DISABLED                               (0x0u<<19)
#define USBD_INTEN_ENDEPOUT7_ENABLED                                (0x1u<<19)
#define USBD_INTEN_ENDEPOUT6_DISABLED                               (0x0u<<18)
#define USBD_INTEN_ENDEPOUT6_ENABLED                                (0x1u<<18)
#define USBD_INTEN_ENDEPOUT5_DISABLED                               (0x0u<<17)
#define USBD_INTEN_ENDEPOUT5_ENABLED                                (0x1u<<17)
#define USBD_INTEN_ENDEPOUT4_DISABLED                               (0x0u<<16)
#define USBD_INTEN_ENDEPOUT4_ENABLED                                (0x1u<<16)
#define USBD_INTEN_ENDEPOUT3_DISABLED                               (0x0u<<15)
#define USBD_INTEN_ENDEPOUT3_ENABLED                                (0x1u<<15)
#define USBD_INTEN_ENDEPOUT2_DISABLED                               (0x0u<<14)
#define USBD_INTEN_ENDEPOUT2_ENABLED                                (0x1u<<14)
#define USBD_INTEN_ENDEPOUT1_DISABLED                               (0x0u<<13)
#define USBD_INTEN_ENDEPOUT1_ENABLED                                (0x1u<<13)
#define USBD_INTEN_ENDEPOUT0_DISABLED                               (0x0u<<12)
#define USBD_INTEN_ENDEPOUT0_ENABLED                                (0x1u<<12)
#define USBD_INTEN_ENDISOIN_DISABLED                                (0x0u<<11)
#define USBD_INTEN_ENDISOIN_ENABLED                                 (0x1u<<11)
#define USBD_INTEN_EP0DATADONE_DISABLED                             (0x0u<<10)
#define USBD_INTEN_EP0DATADONE_ENABLED                              (0x1u<<10)
#define USBD_INTEN_ENDEPIN7_DISABLED                                (0x0u<<9)
#define USBD_INTEN_ENDEPIN7_ENABLED                                 (0x1u<<9)
#define USBD_INTEN_ENDEPIN6_DISABLED                                (0x0u<<8)
#define USBD_INTEN_ENDEPIN6_ENABLED                                 (0x1u<<8)
#define USBD_INTEN_ENDEPIN5_DISABLED                                (0x0u<<7)
#define USBD_INTEN_ENDEPIN5_ENABLED                                 (0x1u<<7)
#define USBD_INTEN_ENDEPIN4_DISABLED                                (0x0u<<6)
#define USBD_INTEN_ENDEPIN4_ENABLED                                 (0x1u<<6)
#define USBD_INTEN_ENDEPIN3_DISABLED                                (0x0u<<5)
#define USBD_INTEN_ENDEPIN3_ENABLED                                 (0x1u<<5)
#define USBD_INTEN_ENDEPIN2_DISABLED                                (0x0u<<4)
#define USBD_INTEN_ENDEPIN2_ENABLED                                 (0x1u<<4)
#define USBD_INTEN_ENDEPIN1_DISABLED                                (0x0u<<3)
#define USBD_INTEN_ENDEPIN1_ENABLED                                 (0x1u<<3)
#define USBD_INTEN_ENDEPIN0_DISABLED                                (0x0u<<2)
#define USBD_INTEN_ENDEPIN0_ENABLED                                 (0x1u<<2)
#define USBD_INTEN_STARTED_DISABLED                                 (0x0u<<1)
#define USBD_INTEN_STARTED_ENABLED                                  (0x1u<<1)
#define USBD_INTEN_USBRESET_DISABLED                                (0x0u<<0)
#define USBD_INTEN_USBRESET_ENABLED                                 (0x1u<<0)

