Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_usbd.h
// INTENSET Configuration

#define USBD_INTENSET_EPDATA                                        (0x1u<<24)
#define USBD_INTENSET_EP0SETUP                                      (0x1u<<23)
#define USBD_INTENSET_USBEVENT                                      (0x1u<<22)
#define USBD_INTENSET_SOF                                           (0x1u<<21)
#define USBD_INTENSET_ENDISOOUT                                     (0x1u<<20)
#define USBD_INTENSET_ENDEPOUT7                                     (0x1u<<19)
#define USBD_INTENSET_ENDEPOUT6                                     (0x1u<<18)
#define USBD_INTENSET_ENDEPOUT5                                     (0x1u<<17)
#define USBD_INTENSET_ENDEPOUT4                                     (0x1u<<16)
#define USBD_INTENSET_ENDEPOUT3                                     (0x1u<<15)
#define USBD_INTENSET_ENDEPOUT2                                     (0x1u<<14)
#define USBD_INTENSET_ENDEPOUT1                                     (0x1u<<13)
#define USBD_INTENSET_ENDEPOUT0                                     (0x1u<<12)
#define USBD_INTENSET_ENDISOIN                                      (0x1u<<11)
#define USBD_INTENSET_EP0DATADONE                                   (0x1u<<10)
#define USBD_INTENSET_ENDEPIN7                                      (0x1u<<9)
#define USBD_INTENSET_ENDEPIN6                                      (0x1u<<8)
#define USBD_INTENSET_ENDEPIN5                                      (0x1u<<7)
#define USBD_INTENSET_ENDEPIN4                                      (0x1u<<6)
#define USBD_INTENSET_ENDEPIN3                                      (0x1u<<5)
#define USBD_INTENSET_ENDEPIN2                                      (0x1u<<4)
#define USBD_INTENSET_ENDEPIN1                                      (0x1u<<3)
#define USBD_INTENSET_ENDEPIN0                                      (0x1u<<2)
#define USBD_INTENSET_STARTED                                       (0x1u<<1)
#define USBD_INTENSET_USBRESET                                      (0x1u<<0)
#define USBD_INTENSET_EPDATA_DISABLED                               (0x0u<<24)
#define USBD_INTENSET_EPDATA_ENABLED                                (0x1u<<24)
#define USBD_INTENSET_EPDATA_SET                                    (0x1u<<24)
#define USBD_INTENSET_EP0SETUP_DISABLED                             (0x0u<<23)
#define USBD_INTENSET_EP0SETUP_ENABLED                              (0x1u<<23)
#define USBD_INTENSET_EP0SETUP_SET                                  (0x1u<<23)
#define USBD_INTENSET_USBEVENT_DISABLED                             (0x0u<<22)
#define USBD_INTENSET_USBEVENT_ENABLED                              (0x1u<<22)
#define USBD_INTENSET_USBEVENT_SET                                  (0x1u<<22)
#define USBD_INTENSET_SOF_DISABLED                                  (0x0u<<21)
#define USBD_INTENSET_SOF_ENABLED                                   (0x1u<<21)
#define USBD_INTENSET_SOF_SET                                       (0x1u<<21)
#define USBD_INTENSET_ENDISOOUT_DISABLED                            (0x0u<<20)
#define USBD_INTENSET_ENDISOOUT_ENABLED                             (0x1u<<20)
#define USBD_INTENSET_ENDISOOUT_SET                                 (0x1u<<20)
#define USBD_INTENSET_ENDEPOUT7_DISABLED                            (0x0u<<19)
#define USBD_INTENSET_ENDEPOUT7_ENABLED                             (0x1u<<19)
#define USBD_INTENSET_ENDEPOUT7_SET                                 (0x1u<<19)
#define USBD_INTENSET_ENDEPOUT6_DISABLED                            (0x0u<<18)
#define USBD_INTENSET_ENDEPOUT6_ENABLED                             (0x1u<<18)
#define USBD_INTENSET_ENDEPOUT6_SET                                 (0x1u<<18)
#define USBD_INTENSET_ENDEPOUT5_DISABLED                            (0x0u<<17)
#define USBD_INTENSET_ENDEPOUT5_ENABLED                             (0x1u<<17)
#define USBD_INTENSET_ENDEPOUT5_SET                                 (0x1u<<17)
#define USBD_INTENSET_ENDEPOUT4_DISABLED                            (0x0u<<16)
#define USBD_INTENSET_ENDEPOUT4_ENABLED                             (0x1u<<16)
#define USBD_INTENSET_ENDEPOUT4_SET                                 (0x1u<<16)
#define USBD_INTENSET_ENDEPOUT3_DISABLED                            (0x0u<<15)
#define USBD_INTENSET_ENDEPOUT3_ENABLED                             (0x1u<<15)
#define USBD_INTENSET_ENDEPOUT3_SET                                 (0x1u<<15)
#define USBD_INTENSET_ENDEPOUT2_DISABLED                            (0x0u<<14)
#define USBD_INTENSET_ENDEPOUT2_ENABLED                             (0x1u<<14)
#define USBD_INTENSET_ENDEPOUT2_SET                                 (0x1u<<14)
#define USBD_INTENSET_ENDEPOUT1_DISABLED                            (0x0u<<13)
#define USBD_INTENSET_ENDEPOUT1_ENABLED                             (0x1u<<13)
#define USBD_INTENSET_ENDEPOUT1_SET                                 (0x1u<<13)
#define USBD_INTENSET_ENDEPOUT0_DISABLED                            (0x0u<<12)
#define USBD_INTENSET_ENDEPOUT0_ENABLED                             (0x1u<<12)
#define USBD_INTENSET_ENDEPOUT0_SET                                 (0x1u<<12)
#define USBD_INTENSET_ENDISOIN_DISABLED                             (0x0u<<11)
#define USBD_INTENSET_ENDISOIN_ENABLED                              (0x1u<<11)
#define USBD_INTENSET_ENDISOIN_SET                                  (0x1u<<11)
#define USBD_INTENSET_EP0DATADONE_DISABLED                          (0x0u<<10)
#define USBD_INTENSET_EP0DATADONE_ENABLED                           (0x1u<<10)
#define USBD_INTENSET_EP0DATADONE_SET                               (0x1u<<10)
#define USBD_INTENSET_ENDEPIN7_DISABLED                             (0x0u<<9)
#define USBD_INTENSET_ENDEPIN7_ENABLED                              (0x1u<<9)
#define USBD_INTENSET_ENDEPIN7_SET                                  (0x1u<<9)
#define USBD_INTENSET_ENDEPIN6_DISABLED                             (0x0u<<8)
#define USBD_INTENSET_ENDEPIN6_ENABLED                              (0x1u<<8)
#define USBD_INTENSET_ENDEPIN6_SET                                  (0x1u<<8)
#define USBD_INTENSET_ENDEPIN5_DISABLED                             (0x0u<<7)
#define USBD_INTENSET_ENDEPIN5_ENABLED                              (0x1u<<7)
#define USBD_INTENSET_ENDEPIN5_SET                                  (0x1u<<7)
#define USBD_INTENSET_ENDEPIN4_DISABLED                             (0x0u<<6)
#define USBD_INTENSET_ENDEPIN4_ENABLED                              (0x1u<<6)
#define USBD_INTENSET_ENDEPIN4_SET                                  (0x1u<<6)
#define USBD_INTENSET_ENDEPIN3_DISABLED                             (0x0u<<5)
#define USBD_INTENSET_ENDEPIN3_ENABLED                              (0x1u<<5)
#define USBD_INTENSET_ENDEPIN3_SET                                  (0x1u<<5)
#define USBD_INTENSET_ENDEPIN2_DISABLED                             (0x0u<<4)
#define USBD_INTENSET_ENDEPIN2_ENABLED                              (0x1u<<4)
#define USBD_INTENSET_ENDEPIN2_SET                                  (0x1u<<4)
#define USBD_INTENSET_ENDEPIN1_DISABLED                             (0x0u<<3)
#define USBD_INTENSET_ENDEPIN1_ENABLED                              (0x1u<<3)
#define USBD_INTENSET_ENDEPIN1_SET                                  (0x1u<<3)
#define USBD_INTENSET_ENDEPIN0_DISABLED                             (0x0u<<2)
#define USBD_INTENSET_ENDEPIN0_ENABLED                              (0x1u<<2)
#define USBD_INTENSET_ENDEPIN0_SET                                  (0x1u<<2)
#define USBD_INTENSET_STARTED_DISABLED                              (0x0u<<1)
#define USBD_INTENSET_STARTED_ENABLED                               (0x1u<<1)
#define USBD_INTENSET_STARTED_SET                                   (0x1u<<1)
#define USBD_INTENSET_USBRESET_DISABLED                             (0x0u<<0)
#define USBD_INTENSET_USBRESET_ENABLED                              (0x1u<<0)
#define USBD_INTENSET_USBRESET_SET                                  (0x1u<<0)

// INTENCLR Configuration

#define USBD_INTENCLR_EPDATA                                        (0x1u<<24)
#define USBD_INTENCLR_EP0SETUP                                      (0x1u<<23)
#define USBD_INTENCLR_USBEVENT                                      (0x1u<<22)
#define USBD_INTENCLR_SOF                                           (0x1u<<21)
#define USBD_INTENCLR_ENDISOOUT                                     (0x1u<<20)
#define USBD_INTENCLR_ENDEPOUT7                                     (0x1u<<19)
#define USBD_INTENCLR_ENDEPOUT6                                     (0x1u<<18)
#define USBD_INTENCLR_ENDEPOUT5                                     (0x1u<<17)
#define USBD_INTENCLR_ENDEPOUT4                                     (0x1u<<16)
#define USBD_INTENCLR_ENDEPOUT3                                     (0x1u<<15)
#define USBD_INTENCLR_ENDEPOUT2                                     (0x1u<<14)
#define USBD_INTENCLR_ENDEPOUT1                                     (0x1u<<13)
#define USBD_INTENCLR_ENDEPOUT0                                     (0x1u<<12)
#define USBD_INTENCLR_ENDISOIN                                      (0x1u<<11)
#define USBD_INTENCLR_EP0DATADONE                                   (0x1u<<10)
#define USBD_INTENCLR_ENDEPIN7                                      (0x1u<<9)
#define USBD_INTENCLR_ENDEPIN6                                      (0x1u<<8)
#define USBD_INTENCLR_ENDEPIN5                                      (0x1u<<7)
#define USBD_INTENCLR_ENDEPIN4                                      (0x1u<<6)
#define USBD_INTENCLR_ENDEPIN3                                      (0x1u<<5)
#define USBD_INTENCLR_ENDEPIN2                                      (0x1u<<4)
#define USBD_INTENCLR_ENDEPIN1                                      (0x1u<<3)
#define USBD_INTENCLR_ENDEPIN0                                      (0x1u<<2)
#define USBD_INTENCLR_STARTED                                       (0x1u<<1)
#define USBD_INTENCLR_USBRESET                                      (0x1u<<0)
#define USBD_INTENCLR_EPDATA_DISABLED                               (0x0u<<24)
#define USBD_INTENCLR_EPDATA_ENABLED                                (0x1u<<24)
#define USBD_INTENCLR_EPDATA_CLEAR                                  (0x1u<<24)
#define USBD_INTENCLR_EP0SETUP_DISABLED                             (0x0u<<23)
#define USBD_INTENCLR_EP0SETUP_ENABLED                              (0x1u<<23)
#define USBD_INTENCLR_EP0SETUP_CLEAR                                (0x1u<<23)
#define USBD_INTENCLR_USBEVENT_DISABLED                             (0x0u<<22)
#define USBD_INTENCLR_USBEVENT_ENABLED                              (0x1u<<22)
#define USBD_INTENCLR_USBEVENT_CLEAR                                (0x1u<<22)
#define USBD_INTENCLR_SOF_DISABLED                                  (0x0u<<21)
#define USBD_INTENCLR_SOF_ENABLED                                   (0x1u<<21)
#define USBD_INTENCLR_SOF_CLEAR                                     (0x1u<<21)
#define USBD_INTENCLR_ENDISOOUT_DISABLED                            (0x0u<<20)
#define USBD_INTENCLR_ENDISOOUT_ENABLED                             (0x1u<<20)
#define USBD_INTENCLR_ENDISOOUT_CLEAR                               (0x1u<<20)
#define USBD_INTENCLR_ENDEPOUT7_DISABLED                            (0x0u<<19)
#define USBD_INTENCLR_ENDEPOUT7_ENABLED                             (0x1u<<19)
#define USBD_INTENCLR_ENDEPOUT7_CLEAR                               (0x1u<<19)
#define USBD_INTENCLR_ENDEPOUT6_DISABLED                            (0x0u<<18)
#define USBD_INTENCLR_ENDEPOUT6_ENABLED                             (0x1u<<18)
#define USBD_INTENCLR_ENDEPOUT6_CLEAR                               (0x1u<<18)
#define USBD_INTENCLR_ENDEPOUT5_DISABLED                            (0x0u<<17)
#define USBD_INTENCLR_ENDEPOUT5_ENABLED                             (0x1u<<17)
#define USBD_INTENCLR_ENDEPOUT5_CLEAR                               (0x1u<<17)
#define USBD_INTENCLR_ENDEPOUT4_DISABLED                            (0x0u<<16)
#define USBD_INTENCLR_ENDEPOUT4_ENABLED                             (0x1u<<16)
#define USBD_INTENCLR_ENDEPOUT4_CLEAR                               (0x1u<<16)
#define USBD_INTENCLR_ENDEPOUT3_DISABLED                            (0x0u<<15)
#define USBD_INTENCLR_ENDEPOUT3_ENABLED                             (0x1u<<15)
#define USBD_INTENCLR_ENDEPOUT3_CLEAR                               (0x1u<<15)
#define USBD_INTENCLR_ENDEPOUT2_DISABLED                            (0x0u<<14)
#define USBD_INTENCLR_ENDEPOUT2_ENABLED                             (0x1u<<14)
#define USBD_INTENCLR_ENDEPOUT2_CLEAR                               (0x1u<<14)
#define USBD_INTENCLR_ENDEPOUT1_DISABLED                            (0x0u<<13)
#define USBD_INTENCLR_ENDEPOUT1_ENABLED                             (0x1u<<13)
#define USBD_INTENCLR_ENDEPOUT1_CLEAR                               (0x1u<<13)
#define USBD_INTENCLR_ENDEPOUT0_DISABLED                            (0x0u<<12)
#define USBD_INTENCLR_ENDEPOUT0_ENABLED                             (0x1u<<12)
#define USBD_INTENCLR_ENDEPOUT0_CLEAR                               (0x1u<<12)
#define USBD_INTENCLR_ENDISOIN_DISABLED                             (0x0u<<11)
#define USBD_INTENCLR_ENDISOIN_ENABLED                              (0x1u<<11)
#define USBD_INTENCLR_ENDISOIN_CLEAR                                (0x1u<<11)
#define USBD_INTENCLR_EP0DATADONE_DISABLED                          (0x0u<<10)
#define USBD_INTENCLR_EP0DATADONE_ENABLED                           (0x1u<<10)
#define USBD_INTENCLR_EP0DATADONE_CLEAR                             (0x1u<<10)
#define USBD_INTENCLR_ENDEPIN7_DISABLED                             (0x0u<<9)
#define USBD_INTENCLR_ENDEPIN7_ENABLED                              (0x1u<<9)
#define USBD_INTENCLR_ENDEPIN7_CLEAR                                (0x1u<<9)
#define USBD_INTENCLR_ENDEPIN6_DISABLED                             (0x0u<<8)
#define USBD_INTENCLR_ENDEPIN6_ENABLED                              (0x1u<<8)
#define USBD_INTENCLR_ENDEPIN6_CLEAR                                (0x1u<<8)
#define USBD_INTENCLR_ENDEPIN5_DISABLED                             (0x0u<<7)
#define USBD_INTENCLR_ENDEPIN5_ENABLED                              (0x1u<<7)
#define USBD_INTENCLR_ENDEPIN5_CLEAR                                (0x1u<<7)
#define USBD_INTENCLR_ENDEPIN4_DISABLED                             (0x0u<<6)
#define USBD_INTENCLR_ENDEPIN4_ENABLED                              (0x1u<<6)
#define USBD_INTENCLR_ENDEPIN4_CLEAR                                (0x1u<<6)
#define USBD_INTENCLR_ENDEPIN3_DISABLED                             (0x0u<<5)
#define USBD_INTENCLR_ENDEPIN3_ENABLED                              (0x1u<<5)
#define USBD_INTENCLR_ENDEPIN3_CLEAR                                (0x1u<<5)
#define USBD_INTENCLR_ENDEPIN2_DISABLED                             (0x0u<<4)
#define USBD_INTENCLR_ENDEPIN2_ENABLED                              (0x1u<<4)
#define USBD_INTENCLR_ENDEPIN2_CLEAR                                (0x1u<<4)
#define USBD_INTENCLR_ENDEPIN1_DISABLED                             (0x0u<<3)
#define USBD_INTENCLR_ENDEPIN1_ENABLED                              (0x1u<<3)
#define USBD_INTENCLR_ENDEPIN1_CLEAR                                (0x1u<<3)
#define USBD_INTENCLR_ENDEPIN0_DISABLED                             (0x0u<<2)
#define USBD_INTENCLR_ENDEPIN0_ENABLED                              (0x1u<<2)
#define USBD_INTENCLR_ENDEPIN0_CLEAR                                (0x1u<<2)
#define USBD_INTENCLR_STARTED_DISABLED                              (0x0u<<1)
#define USBD_INTENCLR_STARTED_ENABLED                               (0x1u<<1)
#define USBD_INTENCLR_STARTED_CLEAR                                 (0x1u<<1)
#define USBD_INTENCLR_USBRESET_DISABLED                             (0x0u<<0)
#define USBD_INTENCLR_USBRESET_ENABLED                              (0x1u<<0)
#define USBD_INTENCLR_USBRESET_CLEAR                                (0x1u<<0)

