Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_usbd.h
// EVENTCAUSE Configuration

#define USBD_EVENTCAUSE_READY                                       (0x1u<<11)
#define USBD_EVENTCAUSE_USBWUALLOWED                                (0x1u<<10)
#define USBD_EVENTCAUSE_RESUME                                      (0x1u<<9)
#define USBD_EVENTCAUSE_SUSPEND                                     (0x1u<<8)
#define USBD_EVENTCAUSE_ISOOUTCRC                                   (0x1u<<0)
#define USBD_EVENTCAUSE_READY_NOTDETECTED                           (0x0u<<11)
#define USBD_EVENTCAUSE_READY_READY                                 (0x1u<<11)
#define USBD_EVENTCAUSE_USBWUALLOWED_NOTALLOWED                     (0x0u<<10)
#define USBD_EVENTCAUSE_USBWUALLOWED_ALLOWED                        (0x1u<<10)
#define USBD_EVENTCAUSE_RESUME_NOTDETECTED                          (0x0u<<9)
#define USBD_EVENTCAUSE_RESUME_DETECTED                             (0x1u<<9)
#define USBD_EVENTCAUSE_SUSPEND_NOTDETECTED                         (0x0u<<8)
#define USBD_EVENTCAUSE_SUSPEND_DETECTED                            (0x1u<<8)
#define USBD_EVENTCAUSE_ISOOUTCRC_NOTDETECTED                       (0x0u<<0)
#define USBD_EVENTCAUSE_ISOOUTCRC_DETECTED                          (0x1u<<0)

// EPIN Configuration

#define USBD_HALTED_EPIN_GETSTATUS                                  (0xFFFFu<<0)
#define USBD_HALTED_EPIN_GETSTATUS_0                                (0x1u<<0)
#define USBD_HALTED_EPIN_GETSTATUS_NOTHALTED                        (0x0u<<0)
#define USBD_HALTED_EPIN_GETSTATUS_HALTED                           (0x1u<<0)

// EPOUT Configuration

#define USBD_HALTED_EPOUT_GETSTATUS                                 (0xFFFFu<<0)
#define USBD_HALTED_EPOUT_GETSTATUS_0                               (0x1u<<0)
#define USBD_HALTED_EPOUT_GETSTATUS_NOTHALTED                       (0x0u<<0)
#define USBD_HALTED_EPOUT_GETSTATUS_HALTED                          (0x1u<<0)

// EPSTATUS Configuration

#define USBD_EPSTATUS_EPOUT8                                        (0x1u<<24)
#define USBD_EPSTATUS_EPOUT7                                        (0x1u<<23)
#define USBD_EPSTATUS_EPOUT6                                        (0x1u<<22)
#define USBD_EPSTATUS_EPOUT5                                        (0x1u<<21)
#define USBD_EPSTATUS_EPOUT4                                        (0x1u<<20)
#define USBD_EPSTATUS_EPOUT3                                        (0x1u<<19)
#define USBD_EPSTATUS_EPOUT2                                        (0x1u<<18)
#define USBD_EPSTATUS_EPOUT1                                        (0x1u<<17)
#define USBD_EPSTATUS_EPOUT0                                        (0x1u<<16)
#define USBD_EPSTATUS_EPIN8                                         (0x1u<<8)
#define USBD_EPSTATUS_EPIN7                                         (0x1u<<7)
#define USBD_EPSTATUS_EPIN6                                         (0x1u<<6)
#define USBD_EPSTATUS_EPIN5                                         (0x1u<<5)
#define USBD_EPSTATUS_EPIN4                                         (0x1u<<4)
#define USBD_EPSTATUS_EPIN3                                         (0x1u<<3)
#define USBD_EPSTATUS_EPIN2                                         (0x1u<<2)
#define USBD_EPSTATUS_EPIN1                                         (0x1u<<1)
#define USBD_EPSTATUS_EPIN0                                         (0x1u<<0)
#define USBD_EPSTATUS_EPOUT8_NODATA                                 (0x0u<<24)
#define USBD_EPSTATUS_EPOUT8_DATADONE                               (0x1u<<24)
#define USBD_EPSTATUS_EPOUT7_NODATA                                 (0x0u<<23)
#define USBD_EPSTATUS_EPOUT7_DATADONE                               (0x1u<<23)
#define USBD_EPSTATUS_EPOUT6_NODATA                                 (0x0u<<22)
#define USBD_EPSTATUS_EPOUT6_DATADONE                               (0x1u<<22)
#define USBD_EPSTATUS_EPOUT5_NODATA                                 (0x0u<<21)
#define USBD_EPSTATUS_EPOUT5_DATADONE                               (0x1u<<21)
#define USBD_EPSTATUS_EPOUT4_NODATA                                 (0x0u<<20)
#define USBD_EPSTATUS_EPOUT4_DATADONE                               (0x1u<<20)
#define USBD_EPSTATUS_EPOUT3_NODATA                                 (0x0u<<19)
#define USBD_EPSTATUS_EPOUT3_DATADONE                               (0x1u<<19)
#define USBD_EPSTATUS_EPOUT2_NODATA                                 (0x0u<<18)
#define USBD_EPSTATUS_EPOUT2_DATADONE                               (0x1u<<18)
#define USBD_EPSTATUS_EPOUT1_NODATA                                 (0x0u<<17)
#define USBD_EPSTATUS_EPOUT1_DATADONE                               (0x1u<<17)
#define USBD_EPSTATUS_EPOUT0_NODATA                                 (0x0u<<16)
#define USBD_EPSTATUS_EPOUT0_DATADONE                               (0x1u<<16)
#define USBD_EPSTATUS_EPIN8_NODATA                                  (0x0u<<8)
#define USBD_EPSTATUS_EPIN8_DATADONE                                (0x1u<<8)
#define USBD_EPSTATUS_EPIN7_NODATA                                  (0x0u<<7)
#define USBD_EPSTATUS_EPIN7_DATADONE                                (0x1u<<7)
#define USBD_EPSTATUS_EPIN6_NODATA                                  (0x0u<<6)
#define USBD_EPSTATUS_EPIN6_DATADONE                                (0x1u<<6)
#define USBD_EPSTATUS_EPIN5_NODATA                                  (0x0u<<5)
#define USBD_EPSTATUS_EPIN5_DATADONE                                (0x1u<<5)
#define USBD_EPSTATUS_EPIN4_NODATA                                  (0x0u<<4)
#define USBD_EPSTATUS_EPIN4_DATADONE                                (0x1u<<4)
#define USBD_EPSTATUS_EPIN3_NODATA                                  (0x0u<<3)
#define USBD_EPSTATUS_EPIN3_DATADONE                                (0x1u<<3)
#define USBD_EPSTATUS_EPIN2_NODATA                                  (0x0u<<2)
#define USBD_EPSTATUS_EPIN2_DATADONE                                (0x1u<<2)
#define USBD_EPSTATUS_EPIN1_NODATA                                  (0x0u<<1)
#define USBD_EPSTATUS_EPIN1_DATADONE                                (0x1u<<1)
#define USBD_EPSTATUS_EPIN0_NODATA                                  (0x0u<<0)
#define USBD_EPSTATUS_EPIN0_DATADONE                                (0x1u<<0)

// EPDATASTATUS Configuration

#define USBD_EPDATASTATUS_EPOUT7                                    (0x1u<<23)
#define USBD_EPDATASTATUS_EPOUT6                                    (0x1u<<22)
#define USBD_EPDATASTATUS_EPOUT5                                    (0x1u<<21)
#define USBD_EPDATASTATUS_EPOUT4                                    (0x1u<<20)
#define USBD_EPDATASTATUS_EPOUT3                                    (0x1u<<19)
#define USBD_EPDATASTATUS_EPOUT2                                    (0x1u<<18)
#define USBD_EPDATASTATUS_EPOUT1                                    (0x1u<<17)
#define USBD_EPDATASTATUS_EPIN7                                     (0x1u<<7)
#define USBD_EPDATASTATUS_EPIN6                                     (0x1u<<6)
#define USBD_EPDATASTATUS_EPIN5                                     (0x1u<<5)
#define USBD_EPDATASTATUS_EPIN4                                     (0x1u<<4)
#define USBD_EPDATASTATUS_EPIN3                                     (0x1u<<3)
#define USBD_EPDATASTATUS_EPIN2                                     (0x1u<<2)
#define USBD_EPDATASTATUS_EPIN1                                     (0x1u<<1)
#define USBD_EPDATASTATUS_EPOUT7_NOTSTARTED                         (0x0u<<23)
#define USBD_EPDATASTATUS_EPOUT7_STARTED                            (0x1u<<23)
#define USBD_EPDATASTATUS_EPOUT6_NOTSTARTED                         (0x0u<<22)
#define USBD_EPDATASTATUS_EPOUT6_STARTED                            (0x1u<<22)
#define USBD_EPDATASTATUS_EPOUT5_NOTSTARTED                         (0x0u<<21)
#define USBD_EPDATASTATUS_EPOUT5_STARTED                            (0x1u<<21)
#define USBD_EPDATASTATUS_EPOUT4_NOTSTARTED                         (0x0u<<20)
#define USBD_EPDATASTATUS_EPOUT4_STARTED                            (0x1u<<20)
#define USBD_EPDATASTATUS_EPOUT3_NOTSTARTED                         (0x0u<<19)
#define USBD_EPDATASTATUS_EPOUT3_STARTED                            (0x1u<<19)
#define USBD_EPDATASTATUS_EPOUT2_NOTSTARTED                         (0x0u<<18)
#define USBD_EPDATASTATUS_EPOUT2_STARTED                            (0x1u<<18)
#define USBD_EPDATASTATUS_EPOUT1_NOTSTARTED                         (0x0u<<17)
#define USBD_EPDATASTATUS_EPOUT1_STARTED                            (0x1u<<17)
#define USBD_EPDATASTATUS_EPIN7_NOTDONE                             (0x0u<<7)
#define USBD_EPDATASTATUS_EPIN7_DATADONE                            (0x1u<<7)
#define USBD_EPDATASTATUS_EPIN6_NOTDONE                             (0x0u<<6)
#define USBD_EPDATASTATUS_EPIN6_DATADONE                            (0x1u<<6)
#define USBD_EPDATASTATUS_EPIN5_NOTDONE                             (0x0u<<5)
#define USBD_EPDATASTATUS_EPIN5_DATADONE                            (0x1u<<5)
#define USBD_EPDATASTATUS_EPIN4_NOTDONE                             (0x0u<<4)
#define USBD_EPDATASTATUS_EPIN4_DATADONE                            (0x1u<<4)
#define USBD_EPDATASTATUS_EPIN3_NOTDONE                             (0x0u<<3)
#define USBD_EPDATASTATUS_EPIN3_DATADONE                            (0x1u<<3)
#define USBD_EPDATASTATUS_EPIN2_NOTDONE                             (0x0u<<2)
#define USBD_EPDATASTATUS_EPIN2_DATADONE                            (0x1u<<2)
#define USBD_EPDATASTATUS_EPIN1_NOTDONE                             (0x0u<<1)
#define USBD_EPDATASTATUS_EPIN1_DATADONE                            (0x1u<<1)

