Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_usbd.h
// USBADDR Configuration

#define USBD_USBADDR_ADDR                                           (0x7Fu<<0)
#define USBD_USBADDR_ADDR_0                                         (0x1u<<0)

// BMREQUESTTYPE Configuration

#define USBD_BMREQUESTTYPE_DIRECTION                                (0x1u<<7)
#define USBD_BMREQUESTTYPE_TYPE                                     (0x3u<<5)
#define USBD_BMREQUESTTYPE_TYPE_0                                   (0x1u<<5)
#define USBD_BMREQUESTTYPE_RECIPIENT                                (0x1Fu<<0)
#define USBD_BMREQUESTTYPE_RECIPIENT_0                              (0x1u<<0)
#define USBD_BMREQUESTTYPE_DIRECTION_HOSTTODEVICE                   (0x0u<<7)
#define USBD_BMREQUESTTYPE_DIRECTION_DEVICETOHOST                   (0x1u<<7)
#define USBD_BMREQUESTTYPE_TYPE_STANDARD                            (0x0u<<5)
#define USBD_BMREQUESTTYPE_TYPE_CLASS                               (0x1u<<5)
#define USBD_BMREQUESTTYPE_TYPE_VENDOR                              (0x2u<<5)
#define USBD_BMREQUESTTYPE_RECIPIENT_DEVICE                         (0x0u<<0)
#define USBD_BMREQUESTTYPE_RECIPIENT_INTERFACE                      (0x1u<<0)
#define USBD_BMREQUESTTYPE_RECIPIENT_ENDPOINT                       (0x2u<<0)
#define USBD_BMREQUESTTYPE_RECIPIENT_OTHER                          (0x3u<<0)

// BREQUEST Configuration

#define USBD_BREQUEST_BREQUEST                                      (0xFFu<<0)
#define USBD_BREQUEST_BREQUEST_0                                    (0x1u<<0)
#define USBD_BREQUEST_BREQUEST_STD_GET_STATUS                       (0x0u<<0)
#define USBD_BREQUEST_BREQUEST_STD_CLEAR_FEATURE                    (0x1u<<0)
#define USBD_BREQUEST_BREQUEST_STD_SET_FEATURE                      (0x3u<<0)
#define USBD_BREQUEST_BREQUEST_STD_SET_ADDRESS                      (0x5u<<0)
#define USBD_BREQUEST_BREQUEST_STD_GET_DESCRIPTOR                   (0x6u<<0)
#define USBD_BREQUEST_BREQUEST_STD_SET_DESCRIPTOR                   (0x7u<<0)
#define USBD_BREQUEST_BREQUEST_STD_GET_CONFIGURATION                (0x8u<<0)
#define USBD_BREQUEST_BREQUEST_STD_SET_CONFIGURATION                (0x9u<<0)
#define USBD_BREQUEST_BREQUEST_STD_GET_INTERFACE                    (0xAu<<0)
#define USBD_BREQUEST_BREQUEST_STD_SET_INTERFACE                    (0xBu<<0)
#define USBD_BREQUEST_BREQUEST_STD_SYNCH_FRAME                      (0xCu<<0)

// WVALUEL Configuration

#define USBD_WVALUEL_WVALUEL                                        (0xFFu<<0)
#define USBD_WVALUEL_WVALUEL_0                                      (0x1u<<0)

// WVALUEH Configuration

#define USBD_WVALUEH_WVALUEH                                        (0xFFu<<0)
#define USBD_WVALUEH_WVALUEH_0                                      (0x1u<<0)

// WINDEXL Configuration

#define USBD_WINDEXL_WINDEXL                                        (0xFFu<<0)
#define USBD_WINDEXL_WINDEXL_0                                      (0x1u<<0)

// WINDEXH Configuration

#define USBD_WINDEXH_WINDEXH                                        (0xFFu<<0)
#define USBD_WINDEXH_WINDEXH_0                                      (0x1u<<0)

// WLENGTHL Configuration

#define USBD_WLENGTHL_WLENGTHL                                      (0xFFu<<0)
#define USBD_WLENGTHL_WLENGTHL_0                                    (0x1u<<0)

// WLENGTHH Configuration

#define USBD_WLENGTHH_WLENGTHH                                      (0xFFu<<0)
#define USBD_WLENGTHH_WLENGTHH_0                                    (0x1u<<0)

// EPOUT Configuration

#define USBD_SIZE_EPOUT_SIZE                                        (0x7Fu<<0)
#define USBD_SIZE_EPOUT_SIZE_0                                      (0x1u<<0)

// ISOOUT Configuration

#define USBD_SIZE_ISOOUT_ZERO                                       (0x1u<<16)
#define USBD_SIZE_ISOOUT_SIZE                                       (0x3FFu<<0)
#define USBD_SIZE_ISOOUT_SIZE_0                                     (0x1u<<0)
#define USBD_SIZE_ISOOUT_ZERO_NORMAL                                (0x0u<<16)
#define USBD_SIZE_ISOOUT_ZERO_ZERODATA                              (0x1u<<16)

// ENABLE Configuration

#define USBD_ENABLE_ENABLE                                          (0x1u<<0)
#define USBD_ENABLE_ENABLE_DISABLED                                 (0x0u<<0)
#define USBD_ENABLE_ENABLE_ENABLED                                  (0x1u<<0)

// USBPULLUP Configuration

#define USBD_USBPULLUP_CONNECT                                      (0x1u<<0)
#define USBD_USBPULLUP_CONNECT_DISABLED                             (0x0u<<0)
#define USBD_USBPULLUP_CONNECT_ENABLED                              (0x1u<<0)

// DPDMVALUE Configuration

#define USBD_DPDMVALUE_STATE                                        (0x1Fu<<0)
#define USBD_DPDMVALUE_STATE_0                                      (0x1u<<0)
#define USBD_DPDMVALUE_STATE_RESUME                                 (0x1u<<0)
#define USBD_DPDMVALUE_STATE_J                                      (0x2u<<0)
#define USBD_DPDMVALUE_STATE_K                                      (0x4u<<0)

// DTOGGLE Configuration

#define USBD_DTOGGLE_VALUE                                          (0x3u<<8)
#define USBD_DTOGGLE_VALUE_0                                        (0x1u<<8)
#define USBD_DTOGGLE_IO                                             (0x1u<<7)
#define USBD_DTOGGLE_EP                                             (0x7u<<0)
#define USBD_DTOGGLE_EP_0                                           (0x1u<<0)
#define USBD_DTOGGLE_VALUE_NOP                                      (0x0u<<8)
#define USBD_DTOGGLE_VALUE_DATA0                                    (0x1u<<8)
#define USBD_DTOGGLE_VALUE_DATA1                                    (0x2u<<8)
#define USBD_DTOGGLE_IO_OUT                                         (0x0u<<7)
#define USBD_DTOGGLE_IO_IN                                          (0x1u<<7)

// EPINEN Configuration

#define USBD_EPINEN_ISOIN                                           (0x1u<<8)
#define USBD_EPINEN_IN7                                             (0x1u<<7)
#define USBD_EPINEN_IN6                                             (0x1u<<6)
#define USBD_EPINEN_IN5                                             (0x1u<<5)
#define USBD_EPINEN_IN4                                             (0x1u<<4)
#define USBD_EPINEN_IN3                                             (0x1u<<3)
#define USBD_EPINEN_IN2                                             (0x1u<<2)
#define USBD_EPINEN_IN1                                             (0x1u<<1)
#define USBD_EPINEN_IN0                                             (0x1u<<0)
#define USBD_EPINEN_ISOIN_DISABLE                                   (0x0u<<8)
#define USBD_EPINEN_ISOIN_ENABLE                                    (0x1u<<8)
#define USBD_EPINEN_IN7_DISABLE                                     (0x0u<<7)
#define USBD_EPINEN_IN7_ENABLE                                      (0x1u<<7)
#define USBD_EPINEN_IN6_DISABLE                                     (0x0u<<6)
#define USBD_EPINEN_IN6_ENABLE                                      (0x1u<<6)
#define USBD_EPINEN_IN5_DISABLE                                     (0x0u<<5)
#define USBD_EPINEN_IN5_ENABLE                                      (0x1u<<5)
#define USBD_EPINEN_IN4_DISABLE                                     (0x0u<<4)
#define USBD_EPINEN_IN4_ENABLE                                      (0x1u<<4)
#define USBD_EPINEN_IN3_DISABLE                                     (0x0u<<3)
#define USBD_EPINEN_IN3_ENABLE                                      (0x1u<<3)
#define USBD_EPINEN_IN2_DISABLE                                     (0x0u<<2)
#define USBD_EPINEN_IN2_ENABLE                                      (0x1u<<2)
#define USBD_EPINEN_IN1_DISABLE                                     (0x0u<<1)
#define USBD_EPINEN_IN1_ENABLE                                      (0x1u<<1)
#define USBD_EPINEN_IN0_DISABLE                                     (0x0u<<0)
#define USBD_EPINEN_IN0_ENABLE                                      (0x1u<<0)

