Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_usbd.h
// EPOUTEN Configuration

#define USBD_EPOUTEN_ISOOUT                                         (0x1u<<8)
#define USBD_EPOUTEN_OUT7                                           (0x1u<<7)
#define USBD_EPOUTEN_OUT6                                           (0x1u<<6)
#define USBD_EPOUTEN_OUT5                                           (0x1u<<5)
#define USBD_EPOUTEN_OUT4                                           (0x1u<<4)
#define USBD_EPOUTEN_OUT3                                           (0x1u<<3)
#define USBD_EPOUTEN_OUT2                                           (0x1u<<2)
#define USBD_EPOUTEN_OUT1                                           (0x1u<<1)
#define USBD_EPOUTEN_OUT0                                           (0x1u<<0)
#define USBD_EPOUTEN_ISOOUT_DISABLE                                 (0x0u<<8)
#define USBD_EPOUTEN_ISOOUT_ENABLE                                  (0x1u<<8)
#define USBD_EPOUTEN_OUT7_DISABLE                                   (0x0u<<7)
#define USBD_EPOUTEN_OUT7_ENABLE                                    (0x1u<<7)
#define USBD_EPOUTEN_OUT6_DISABLE                                   (0x0u<<6)
#define USBD_EPOUTEN_OUT6_ENABLE                                    (0x1u<<6)
#define USBD_EPOUTEN_OUT5_DISABLE                                   (0x0u<<5)
#define USBD_EPOUTEN_OUT5_ENABLE                                    (0x1u<<5)
#define USBD_EPOUTEN_OUT4_DISABLE                                   (0x0u<<4)
#define USBD_EPOUTEN_OUT4_ENABLE                                    (0x1u<<4)
#define USBD_EPOUTEN_OUT3_DISABLE                                   (0x0u<<3)
#define USBD_EPOUTEN_OUT3_ENABLE                                    (0x1u<<3)
#define USBD_EPOUTEN_OUT2_DISABLE                                   (0x0u<<2)
#define USBD_EPOUTEN_OUT2_ENABLE                                    (0x1u<<2)
#define USBD_EPOUTEN_OUT1_DISABLE                                   (0x0u<<1)
#define USBD_EPOUTEN_OUT1_ENABLE                                    (0x1u<<1)
#define USBD_EPOUTEN_OUT0_DISABLE                                   (0x0u<<0)
#define USBD_EPOUTEN_OUT0_ENABLE                                    (0x1u<<0)

// EPSTALL Configuration

#define USBD_EPSTALL_STALL                                          (0x1u<<8)
#define USBD_EPSTALL_IO                                             (0x1u<<7)
#define USBD_EPSTALL_EP                                             (0x7u<<0)
#define USBD_EPSTALL_EP_0                                           (0x1u<<0)
#define USBD_EPSTALL_STALL_UNSTALL                                  (0x0u<<8)
#define USBD_EPSTALL_STALL_STALL                                    (0x1u<<8)
#define USBD_EPSTALL_IO_OUT                                         (0x0u<<7)
#define USBD_EPSTALL_IO_IN                                          (0x1u<<7)

// ISOSPLIT Configuration

#define USBD_ISOSPLIT_SPLIT                                         (0xFFFFu<<0)
#define USBD_ISOSPLIT_SPLIT_0                                       (0x1u<<0)
#define USBD_ISOSPLIT_SPLIT_ONEDIR                                  (0x0u<<0)
#define USBD_ISOSPLIT_SPLIT_HALFIN                                  (0x80u<<0)

// FRAMECNTR Configuration

#define USBD_FRAMECNTR_FRAMECNTR                                    (0x7FFu<<0)
#define USBD_FRAMECNTR_FRAMECNTR_0                                  (0x1u<<0)

// LOWPOWER Configuration

#define USBD_LOWPOWER_LOWPOWER                                      (0x1u<<0)
#define USBD_LOWPOWER_LOWPOWER_FORCENORMAL                          (0x0u<<0)
#define USBD_LOWPOWER_LOWPOWER_LOWPOWER                             (0x1u<<0)

// ISOINCONFIG Configuration

#define USBD_ISOINCONFIG_RESPONSE                                   (0x1u<<0)
#define USBD_ISOINCONFIG_RESPONSE_NORESP                            (0x0u<<0)
#define USBD_ISOINCONFIG_RESPONSE_ZERODATA                          (0x1u<<0)

// PTR Configuration

#define USBD_EPIN_PTR_PTR                                           (0xFFFFFFFFu<<0)
#define USBD_EPIN_PTR_PTR_0                                         (0x1u<<0)

// MAXCNT Configuration

#define USBD_EPIN_MAXCNT_MAXCNT                                     (0x7Fu<<0)
#define USBD_EPIN_MAXCNT_MAXCNT_0                                   (0x1u<<0)

// AMOUNT Configuration

#define USBD_EPIN_AMOUNT_AMOUNT                                     (0x7Fu<<0)
#define USBD_EPIN_AMOUNT_AMOUNT_0                                   (0x1u<<0)

// PTR Configuration

#define USBD_ISOIN_PTR_PTR                                          (0xFFFFFFFFu<<0)
#define USBD_ISOIN_PTR_PTR_0                                        (0x1u<<0)

// MAXCNT Configuration

#define USBD_ISOIN_MAXCNT_MAXCNT                                    (0x3FFu<<0)
#define USBD_ISOIN_MAXCNT_MAXCNT_0                                  (0x1u<<0)

// AMOUNT Configuration

#define USBD_ISOIN_AMOUNT_AMOUNT                                    (0x3FFu<<0)
#define USBD_ISOIN_AMOUNT_AMOUNT_0                                  (0x1u<<0)

// PTR Configuration

#define USBD_EPOUT_PTR_PTR                                          (0xFFFFFFFFu<<0)
#define USBD_EPOUT_PTR_PTR_0                                        (0x1u<<0)

// MAXCNT Configuration

#define USBD_EPOUT_MAXCNT_MAXCNT                                    (0x7Fu<<0)
#define USBD_EPOUT_MAXCNT_MAXCNT_0                                  (0x1u<<0)

// AMOUNT Configuration

#define USBD_EPOUT_AMOUNT_AMOUNT                                    (0x7Fu<<0)
#define USBD_EPOUT_AMOUNT_AMOUNT_0                                  (0x1u<<0)

// PTR Configuration

#define USBD_ISOOUT_PTR_PTR                                         (0xFFFFFFFFu<<0)
#define USBD_ISOOUT_PTR_PTR_0                                       (0x1u<<0)

// MAXCNT Configuration

#define USBD_ISOOUT_MAXCNT_MAXCNT                                   (0x3FFu<<0)
#define USBD_ISOOUT_MAXCNT_MAXCNT_0                                 (0x1u<<0)

// AMOUNT Configuration

#define USBD_ISOOUT_AMOUNT_AMOUNT                                   (0x3FFu<<0)
#define USBD_ISOOUT_AMOUNT_AMOUNT_0                                 (0x1u<<0)
